---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipeMassPerUnitLength
source: html/519a74f6-2242-5be4-02c9-49a8e9ba3019.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipeMassPerUnitLength Property

Mass per Unit Length, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipeMassPerUnitLength { get; }
```